uyencorki/uvc-ai-stm32/Src/app.c
typedef struct {
  uint64_t current_total;
  uint64_t current_thread_total;
  uint64_t prev_total;
  uint64_t prev_thread_total;
  struct {
    uint64_t total;
    uint64_t thread;
    uint32_t tick;
  } history[CPU_LOAD_HISTORY_DEPTH];
} cpuload_info_t;

/* Globals */
/* display */
static DRAW_Font_t font_12;
static DRAW_Font_t font_16;
static SemaphoreHandle_t stat_info_lock;
static StaticSemaphore_t stat_info_lock_buffer;
static stat_info_t stat_info;
static cpuload_info_t cpu_load;
static int g_pipe1_first_frame_logged;
static int g_pipe2_first_frame_logged;
static int g_pipe1_first_vsync_logged;
static uint32_t g_pipe1_frame_irq_count;
static uint32_t g_pipe2_frame_irq_count;
static uint32_t g_pipe1_vsync_irq_count;
static uint32_t g_pipe_error_irq_count[3];
static uint32_t g_cam_health_last_ms;
static uint32_t g_cam_health_last_pipe1_frame;
static uint32_t g_cam_health_last_pipe2_frame;
static uint32_t g_cam_health_last_pipe1_vsync;
static uint32_t g_cam_health_last_pipe_err[3];
static uint32_t g_pipe1_rearm_ok_count;
static uint32_t g_pipe1_rearm_fail_count;
static volatile int g_pipe1_dump_pending;
static volatile int g_pipe1_dump_idx = -1;
static uint32_t g_pipe1_dump_last_ms;
static int g_pipe1_first_frame_pending_log;
static int g_pipe2_first_frame_pending_log;
static int g_pipe1_first_vsync_pending_log;
static int g_pipe1_first_rearm_ok_pending_log;
static int g_pipe1_rearm_fail_pending_log;
static int g_pipe1_rearm_fail_last_ret;
static uint32_t g_pipe1_rearm_fail_last_state;
static int g_pipe1_rearm_fail_last_disp_idx;
static int g_pipe1_rearm_fail_last_capt_idx;
static int g_pipe1_rearm_fail_last_next_idx;
static int g_pipe1_first_rearm_ok_next_idx;
static uint32_t g_pipe1_first_rearm_ok_addr;

/* Forward declarations: used by early debug dump helper before full definitions below. */
static uint8_t capture_buffer[CAPTURE_BUFFER_NB][VENC_MAX_WIDTH * VENC_MAX_HEIGHT * CAPTURE_BPP];
static int capture_buffer_disp_idx;

static void app_dump_pipe1_frame_data_1s(void)
{
#if APP_PIPE1_FRAME_DUMP_ENABLE
  uint8_t *src;
  uintptr_t src_addr;
  uintptr_t inval_addr;
  uint32_t inval_len;
  uint32_t now_ms;
  uint32_t sum;
  int idx;
  int i;
  uint8_t sample[APP_PIPE1_FRAME_DUMP_BYTES];

  if (g_pipe1_dump_pending == 0)
  {
    return;
  }

  now_ms = HAL_GetTick();
  if ((now_ms - g_pipe1_dump_last_ms) < 1000U)
  {
    return;
  }

  idx = g_pipe1_dump_idx;
  if ((idx < 0) || (idx >= CAPTURE_BUFFER_NB))
  {
    g_pipe1_dump_pending = 0;
    return;
  }

  src = capture_buffer[idx];
  src_addr = (uintptr_t)src;
  inval_addr = src_addr & ~((uintptr_t)31U);
  inval_len = ALIGN_VALUE((uint32_t)((src_addr - inval_addr) + APP_PIPE1_FRAME_DUMP_BYTES), 32U);
  CACHE_OP(SCB_InvalidateDCache_by_Addr((uint8_t *)inval_addr, inval_len));

  sum = 0U;
  for (i = 0; i < APP_PIPE1_FRAME_DUMP_BYTES; i++)
  {
    sample[i] = src[i];
    sum += sample[i];
  }

  printf("[CAM][DATA] p1 idx=%d addr=0x%08lX b0..b7=%02X %02X %02X %02X %02X %02X %02X %02X sum%u=%lu\r\n",
         idx,
         (unsigned long)capture_buffer[idx],
         sample[0], sample[1], sample[2], sample[3],
         sample[4], sample[5], sample[6], sample[7],
         APP_PIPE1_FRAME_DUMP_BYTES,
         (unsigned long)sum);

  g_pipe1_dump_last_ms = now_ms;
  g_pipe1_dump_pending = 0;
#endif
}

static void app_log_cam_health_1s(void)
{
  uint32_t now_ms = HAL_GetTick();

  if ((now_ms - g_cam_health_last_ms) < 1000U)
  {
    return;
  }

    printf("[CAM][HEALTH] 1s p1_frame=+%lu p2_frame=+%lu p1_vsync=+%lu rearm_ok=%lu rearm_fail=%lu err0=+%lu err1=+%lu err2=+%lu tot_err=(%lu,%lu,%lu)\r\n",
         (unsigned long)(g_pipe1_frame_irq_count - g_cam_health_last_pipe1_frame),
         (unsigned long)(g_pipe2_frame_irq_count - g_cam_health_last_pipe2_frame),
         (unsigned long)(g_pipe1_vsync_irq_count - g_cam_health_last_pipe1_vsync),
      (unsigned long)g_pipe1_rearm_ok_count,
      (unsigned long)g_pipe1_rearm_fail_count,
         (unsigned long)(g_pipe_error_irq_count[0] - g_cam_health_last_pipe_err[0]),
         (unsigned long)(g_pipe_error_irq_count[1] - g_cam_health_last_pipe_err[1]),
         (unsigned long)(g_pipe_error_irq_count[2] - g_cam_health_last_pipe_err[2]),
         (unsigned long)g_pipe_error_irq_count[0],
         (unsigned long)g_pipe_error_irq_count[1],
         (unsigned long)g_pipe_error_irq_count[2]);

  g_cam_health_last_ms = now_ms;
  g_cam_health_last_pipe1_frame = g_pipe1_frame_irq_count;
  g_cam_health_last_pipe2_frame = g_pipe2_frame_irq_count;
  g_cam_health_last_pipe1_vsync = g_pipe1_vsync_irq_count;
  g_cam_health_last_pipe_err[0] = g_pipe_error_irq_count[0];
  g_cam_health_last_pipe_err[1] = g_pipe_error_irq_count[1];
  g_cam_health_last_pipe_err[2] = g_pipe_error_irq_count[2];
}

static void app_flush_cam_irq_logs(void)
{
  if (g_pipe1_first_vsync_pending_log != 0)
  {
    g_pipe1_first_vsync_pending_log = 0;
    printf("[CAM] pipe1 first VSYNC IRQ\r\n");
  }

  if (g_pipe1_first_frame_pending_log != 0)
  {
    g_pipe1_first_frame_pending_log = 0;
    printf("[CAM] pipe1 first frame IRQ\r\n");
  }

  if (g_pipe2_first_frame_pending_log != 0)
  {
    g_pipe2_first_frame_pending_log = 0;
    printf("[CAM] pipe2 first frame IRQ\r\n");
  }

  if (g_pipe1_first_rearm_ok_pending_log != 0)
  {
    g_pipe1_first_rearm_ok_pending_log = 0;
    printf("[CAM] pipe1 rearm OK next_capt_idx=%d addr=0x%08lX\r\n",
           g_pipe1_first_rearm_ok_next_idx,
           (unsigned long)g_pipe1_first_rearm_ok_addr);
  }

  if (g_pipe1_rearm_fail_pending_log != 0)
  {
    g_pipe1_rearm_fail_pending_log = 0;
    printf("[CAM][ERR] pipe1 rearm failed ret=%d state=%lu disp_idx=%d capt_idx=%d next=%d\r\n",
           g_pipe1_rearm_fail_last_ret,
           (unsigned long)g_pipe1_rearm_fail_last_state,
           g_pipe1_rearm_fail_last_disp_idx,
           g_pipe1_rearm_fail_last_capt_idx,
           g_pipe1_rearm_fail_last_next_idx);
  }
}

void APP_CAM_DebugOnPipeError(uint32_t pipe)
{
  if (pipe < 3U)
  {
    g_pipe_error_irq_count[pipe]++;
  }
}

/* dma2d */
static SemaphoreHandle_t dma2d_lock;
static StaticSemaphore_t dma2d_lock_buffer;
static SemaphoreHandle_t dma2d_sem;
static StaticSemaphore_t dma2d_sem_buffer;
/* Store current DMA2D_HandleTypeDef instance so we can propagate to irq handler */
static DMA2D_HandleTypeDef *dma2d_current;

